VIV_Numerical_Codes/Flexible_pipe/fluids/strip01/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           $internalField;
    }

    OUTLET
    {
        type            zeroGradient;
    }
    
    SYM
    {
        type            symmetry;
    }

    CYLINDER
    {
        type            movingWallVelocity;
        value           uniform        (0 0 0);
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
