VIV_Numerical_Codes/Flexible_pipe/fluids/strip01/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 7845;

boundaryField
{


     OUTLET
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    INLET
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    CYLINDER
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }

    SYM
    {
        type            symmetry;
    }

}


// ************************************************************************* //
