VIV_Numerical_Codes/Flexible_pipe/fluids/strip01/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

motionSolver    displacementLaplacian;

displacementLaplacianCoeffs
{
    diffusivity inversePointDistance (CYLINDER);
    //eg. diffusivity    quadratic     inverseDistance      5.0     ( Body );
    //              [ Distance Type]  [diffusivity model][ Distance] [Patch]
    // (1) inverseDistance
    // (2) inverseFaceDistance
    // (3) inversePointDistance
    // (4) inverseVolume
    // (5) uniform


}


// ************************************************************************* //
