VIV_Numerical_Codes/Flexible_pipe/fluids/strip01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    INLET
    {
        type            patch;
        nFaces          157;
        startFace       105772;
    }
    OUTLET
    {
        type            patch;
        nFaces          157;
        startFace       105929;
    }
    SYM
    {
        type            symmetry;
        inGroups        List<word> 1(wall);
        nFaces          514;
        startFace       106086;
    }
    CYLINDER
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          236;
        startFace       106600;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          106304;
        startFace       106836;
    }
)

// ************************************************************************* //
